{"id":325,"date":"2017-01-04T12:22:00","date_gmt":"2017-01-04T12:22:00","guid":{"rendered":"https:\/\/raratheme.com\/preview\/education-zone-pro\/?page_id=325"},"modified":"2022-02-06T01:11:30","modified_gmt":"2022-02-06T01:11:30","slug":"our-community","status":"publish","type":"page","link":"https:\/\/www.sramps.sch.ae\/our-community\/","title":{"rendered":"Our Community"},"content":{"rendered":"<p>You can display all kind of information about community of your college or university.<\/p>\n<p>A community college is a type of educational institution. The term can have different meanings in different countries, but usually refers to an educational institution that provides tertiary education and continuing education supplemental to traditional universities and colleges.<\/p>\n<h2>Sports<\/h2>\n\n<p>TAFEs and other providers carry on the tradition of adult education, which was established in Australia around mid 19th century when evening classes were held to help adults enhance their numeracy and literacy skills.[1] Most Australian universities can also be traced back to such forerunners, although obtaining a university charter has always changed their nature. In TAFEs and colleges today, courses are designed for personal development of an individual and\/or for employment outcomes. Educational programs cover a variety of topics such as arts, languages, business and lifestyle, and are usually timetabled to be conducted in the evenings or weekends to accommodate people working full-time. Funding for colleges may come from government grants and course fees, and many are not-for-profit organisations. There are located in metropolitan, regional and rural locations of Australia.<\/p>\n<figure id=\"attachment_92\" aria-describedby=\"caption-attachment-92\" style=\"width: 400px\" class=\"wp-caption alignright\"><img loading=\"lazy\" decoding=\"async\" class=\"wp-image-92\" src=\"https:\/\/www.sramps.sch.ae\/wp-content\/uploads\/2016\/12\/class-377117_19201.jpg\" width=\"400\" height=\"149\" \/><figcaption id=\"caption-attachment-92\" class=\"wp-caption-text\">Computer lab<\/figcaption><\/figure>\n<p>Learning offered by TAFEs and colleges has changed over the years. By the 1980s many colleges had recognised a community need for computer training and since then thousands of people have been up-skilled through IT courses. The majority of colleges by the late 20th century had also become Registered Training Organisations, recognising the need to offer individuals a nurturing, non-traditional education venue to gain skills that would better prepare them for the workplace and potential job openings.[2] TAFEs and colleges have not traditionally offered bachelor&#8217;s degrees, instead providing pathway arrangements with universities to continue towards degrees. The American innovation of the associate degree is emerging at some institutions. Certificate courses I to IV, diplomas and advanced diplomas are typically offered, the latter deemed equivalent to an undergraduate qualification, albeit typically in more vocational areas. Recently, some TAFE institutes (and private providers) have also become higher education providers in their own right and are now starting to offer bachelor&#8217;s degrees programs.<\/p>\n<h2>Library and Computer Lab<\/h2>\n\n<p>In addition to graduate degrees, universities generally grant Associate&#8217;s degrees and Bachelor&#8217;s degrees, but in some regions and\/or courses of study, colleges and universities collaborate so college students can earn transfer credits toward undergraduate university degrees.<\/p>\n<p>University degrees are usually attained through four years of study. The term associate degree is used in western Canada to refer to a two-year college arts or science degree, similar to how the term is used in the United States. In other parts of Canada the term advanced degree is used to indicate a 3- or 4-year college program.<\/p>\n<p>In the province of Quebec, three years is the norm for a university degree because a year of credit is earned in the CEGEP (college) system. Even when speaking in English, people often refer to all colleges as [3] Cégeps, however the term is an acronym more correctly applied specifically to the French-language public system: Collège d&#8217;enseignement général et professionnel (CEGEP); in English: College of General and Vocational Education. The word College can also refer to a private High School in Quebec.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You can display all kind of information about community of your college or university. A community college is a type &hellip; <\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"om_disable_all_campaigns":false,"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"_uf_show_specific_survey":0,"_uf_disable_surveys":false,"footnotes":""},"class_list":["post-325","page","type-page","status-publish","hentry","latest_post"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/pages\/325","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/comments?post=325"}],"version-history":[{"count":1,"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/pages\/325\/revisions"}],"predecessor-version":[{"id":660,"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/pages\/325\/revisions\/660"}],"wp:attachment":[{"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/media?parent=325"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}