{"id":971,"date":"2022-02-19T23:38:16","date_gmt":"2022-02-19T19:38:16","guid":{"rendered":"http:\/\/www.sramps.sch.ae\/?page_id=971"},"modified":"2023-02-28T12:20:57","modified_gmt":"2023-02-28T08:20:57","slug":"cyber-security-policy","status":"publish","type":"page","link":"https:\/\/www.sramps.sch.ae\/cyber-security-policy\/","title":{"rendered":"Cyber Security Guide"},"content":{"rendered":"\n<p><strong>1.<\/strong> <strong>INTRODUCTION<\/strong><\/p>\n\n\n\n<p>H.H. Shaikh Rashid Al Maktoum Pakistan School (hereby referred to as ‘the School) believes digital technologies and internet access are essential for modern learning. Millennials spend increasing amounts of time online for various activities. The post-COVID world is seeing a changing trend where the importance of online education, virtual meetings and data availability necessitates drawing guidelines for internet users, especially teachers, students and parents. Providing easy internet access to students and teachers where a wealth of valuable information can be used, students and trainers must be safe, and responsible and ethical values are adhered to using digital technologies.<\/p>\n\n\n\n<p><strong>2. PURPOSE AND SCOPE<\/strong><\/p>\n\n\n\n<p>This policy aims to provide a framework as to how the School uses digital technologies for teaching and learning, behavioural expectations and parents’ responsibilities for guidance.<\/p>\n\n\n\n<p>The IT department at the School is working towards implementing secure and safe cyberspace by establishing better systems to ensure the productive use of digital technology. Web-filtering functionality, firewalls and other modes enable the trainers and teachers to enforce strict checks for online access and restrict unwanted material. &nbsp;<\/p>\n\n\n\n<p><strong>3. OBJECTIVES<\/strong><\/p>\n\n\n\n<p>ICT provides students with the tools to transform their learning and enrich their learning environment. With this policy, we aim to:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Provide a clearly stated cybersecurity policy<\/li>\n\n\n\n<li>Give detailed information on the cyber laws of Dubai<\/li>\n\n\n\n<li>Ensure the cyber safety and digital security of the school community with proper measures and controls set by the IT department as approved by the Management<\/li>\n\n\n\n<li>Provide procedures to report cyber-bullying incidents and misuse of internet access.<\/li>\n<\/ul>\n\n\n\n<p><strong>4. TERMINOLOGY<\/strong><\/p>\n\n\n\n<p><strong>Cybersecurity<\/strong> “protects a person, organisation, or country and their computer information against crime or attacks carried out using the internet.”<\/p>\n\n\n\n<p><strong>Cyberbullying <\/strong>is “the activity of using the internet to harm or frighten another person, especially by sending them unpleasant messages”.<\/p>\n\n\n\n<p><strong>5. LEGISLATION<\/strong><\/p>\n\n\n\n<p>This policy aims to ensure that the School is compliant with the terms of:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Article 29 of Federal Law No. 3 of 2016 Concerning Child Rights, also known as Wadeema&#8217;s Law<\/li>\n\n\n\n<li>Dubai Data Law (Law No. 26 of 2015 on the Organization of Dubai Data Publication and Sharing)<\/li>\n\n\n\n<li>Article 29 of Federal Law No. 3 of 2016 Concerning Child Rights states: “The telecommunications companies and internet service providers shall notify the competent authorities or the concerned entities of any child pornography materials being circulated through the social media sites and on the Internet and shall provide necessary information and data on the persons, entities or sites that circulate such material or intend to mislead the children.”<\/li>\n\n\n\n<li>“The Dubai Data Law (Law No. 26 of 2015 on the Organization of Dubai Data Publication and Sharing) aims for data protection and privacy of all individuals including that of children.”<\/li>\n\n\n\n<li>Moreover, “Ministry of Interior and the National Programme for Happiness and Wellbeing launched the ‘Child Digital Safety’ initiative in March 2018, in a joint effort to raise awareness among children and school students about online threats and challenges, and promote a safe and constructive use of the internet.”<\/li>\n<\/ul>\n\n\n\n<p><strong>6. TARGETS<\/strong><\/p>\n\n\n\n<p>In compliance with Federal Legislation, the School aims to:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Provide education that gives access to current and appropriate educational technologies<\/li>\n\n\n\n<li>Introduce students to different tools for using digital technologies safely and responsibly and its consequences through laid down guidelines, seminars and workshops<\/li>\n\n\n\n<li>Provide students with opportunities to access digital technologies with secure internet access for a safer digital environment<\/li>\n\n\n\n<li>Educate the School community about the smart, safe and responsible use of ICT<\/li>\n\n\n\n<li>Educate the School community on cyber-bullying and ways to prevent it\n<ul class=\"wp-block-list\">\n<li>Alert the School for signs and evidence of cyberbullying and report the matter to the School’s Management immediately, whether as an observer or victim.<\/li>\n\n\n\n<li>Ensure that all reported incidents of cyber-bullying are followed up timely, support is given to all individuals involved, and remedial measures are taken.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>7. RESPONSIBILITIES OF THE IT DEPARTMENT<\/strong><\/p>\n\n\n\n<p>The IT department plays a vital role in managing security and controls of internet and technology usage within the School. They must carry out the following tasks regularly to ensure the safety of the School community:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Monitoring, maintenance and testing of security controls by ensuring the security configuration for all the ICT systems<\/li>\n\n\n\n<li>Conducting regular tests and system maintenance to ensure security configuration is running efficiently and providing any updates needed to keep it relevant<\/li>\n\n\n\n<li>Regular supervision of all systems, servers and networks, as well as monitoring CCTV to report any unusual activities to ensure the safety of the students and teachers<\/li>\n\n\n\n<li>Controlling administrative and privileged access. Create segmented accounts for established users, place limits on the user’s privileges and monitor activities<\/li>\n\n\n\n<li>Set passwords for the usage of any IT-related systems and applications and change them at intervals as deemed appropriate<\/li>\n\n\n\n<li>Protect the systems with anti-malware defences by installing various software to protect the school’s digital data<\/li>\n\n\n\n<li>Report any incident or breach seen or indicated to the school Management immediately<\/li>\n\n\n\n<li>Outline email security measures and strict checks to be maintained<\/li>\n\n\n\n<li>Set rules around handling technology and training to be given to trainers and staff on how to handle sensitive data.<\/li>\n\n\n\n<li>Set standards for social media and internet access and be well prepared for a breach or disciplinary issue and prepare an incident which will be forwarded to the Management for appropriate action.<\/li>\n\n\n\n<li>Keep this policy up-to-date.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>8. CYBERBULLYING<\/strong><\/p>\n\n\n\n<p>Cyberbullying is one of the biggest challenges faced by training institutes, especially schools. &nbsp;The negative impact of social media dents the self-esteem of students and teachers, leading to physical and emotional harm. It is crucial to monitor cyber-bullying and take remedial steps through;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The school will undertake appropriate measures to continuously block access to unsuitable internet sites such as social media platforms, chatrooms and online gaming sites.<\/li>\n\n\n\n<li>Parental support and cooperation are essential to the success of this policy. Parents will be regularly guided and informed of ethical internet usage by the students during school hours. Necessary assistance will be provided for any cyberbullying incident during school timings or out-of-school and out-of-school hours.<\/li>\n\n\n\n<li>Students and staff must retain the evidence of cyber-bullying for use by the School Management and the relevant law enforcement agencies<\/li>\n\n\n\n<li>The School will provide regular updates and guidance to students, parents, staff and faculty to be aware of the effects and (legal) consequences of cyber-bullying and digital safety and literacy programs.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>9. DATA PROTECTION<\/strong><\/p>\n\n\n\n<p><strong>9.1. <\/strong>THE SCHOOL collects and uses certain types of personal information about staff, students, alumni, Governors, parents and other individuals who encounter the School to provide education and related functions. The School may be required by law to collect and use certain types of information to comply with statutory obligations related to employment, education and protection of individuals. This section will ensure that personal information is dealt with appropriately, securely, and in accordance with the UAE legislation on data protection.<\/p>\n\n\n\n<p><strong>9.2.<\/strong> This section applies to all personal information regardless of how it is collected, used, recorded, stored and destroyed, whether paper-based or electronically.<\/p>\n\n\n\n<p><strong>9.3. <\/strong>Definition of Personal Data: <em>Any data relating to an identified natural person, or a natural person who can be identified, directly or indirectly, through the linking of data, by reference to an identifier such as his name, voice, image, identification number, online identifier, geographical location, or one or more physical, physiological, economic, cultural or social characteristics.<\/em><\/p>\n\n\n\n<p><strong>9.4. <\/strong>Each student, parent, and employee is provided with a username and password for the School’s Learning Management System (LMS). All details are secured in a database handled by the School’s IT department. If the individual cannot access their account, it should be informed to the Head of the IT Department.<\/p>\n\n\n\n<p><strong>9.5. <\/strong>Employees must send emails through authorised channels such as LMS and Webmail. No other third-party email provider should be used to send emails. Students and parents must email the concerned staff to their official school emails or through LMS. This is to ensure the communication is being delivered to the right person.<\/p>\n\n\n\n<p><strong>9.6. <\/strong>Social media and non-educational websites are blocked for students and staff. Only authorised staff members have been given privileges to use them for school purposes.<\/p>\n\n\n\n<p><strong>9.7. <\/strong>Unauthorised or unlawful use of the internet by students and staff or the processing of personal data by employees will be subject to appropriate disciplinary action.<\/p>\n\n\n\n<p><strong>9.8.<\/strong> The School will maintain strong data governance at all times. Therefore, the School will:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Inform all individuals clearly about the reason for collecting their personal data at the point of collection.<\/li>\n\n\n\n<li>Inform individuals when, why and with whom their data is shared.<\/li>\n\n\n\n<li>Check the quality and accuracy of the data.<\/li>\n\n\n\n<li>Ensure data is retained until necessary and is deleted\/destroyed securely appropriately.<\/li>\n\n\n\n<li>Ensure that clear and robust safeguards are in place to protect personal data from loss, theft and unauthorised disclosure, irrespective of the format in which it is recorded.<\/li>\n\n\n\n<li>Share data with others only when legally appropriate.<\/li>\n\n\n\n<li>Ensure procedures are followed when responding to requests to access personal data.<\/li>\n\n\n\n<li>Ensure all employees are aware of and understand the Cybersecurity Policy.<\/li>\n\n\n\n<li>Ensure all complaints relating to Data Protection are dealt with in accordance with the School’s Complaints Policy.<\/li>\n<\/ul>\n\n\n\n<p><strong>To learn more about cybersecurity and the prevention of cybercrimes and cyberbullying, refer to the<\/strong><u><span style=\"text-decoration: underline;\"> <\/span><\/u><strong><u>School’s Cybersecurity Guide 2021-22.<\/u><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>1. INTRODUCTION H.H. Shaikh Rashid Al Maktoum Pakistan School (hereby referred to as ‘the School) believes digital technologies and internet &hellip; <\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"om_disable_all_campaigns":false,"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"_uf_show_specific_survey":0,"_uf_disable_surveys":false,"footnotes":""},"class_list":["post-971","page","type-page","status-publish","hentry","latest_post"],"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/pages\/971","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/comments?post=971"}],"version-history":[{"count":5,"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/pages\/971\/revisions"}],"predecessor-version":[{"id":1818,"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/pages\/971\/revisions\/1818"}],"wp:attachment":[{"href":"https:\/\/www.sramps.sch.ae\/wp-json\/wp\/v2\/media?parent=971"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}